### MIC stand for Multiveriate imputation by Chanied Equation

#### Assumptions
1. MCAR(Missing complet at random)
2. MAR(Missing at random)
3. MNAR(Missing not at random)

#### Advantages & Disadvantage

1. its quait accurate  & Compltely slow all program

In [216]:
import numpy as np
import pandas as pd

from sklearn.linear_model import LinearRegression

In [217]:
df = np.round(pd.read_csv('50_Startups.csv')[['R&D Spend','Administration','Marketing Spend','Profit']]/10000)
np.random.seed(9)
df = df.sample(5)
df

    R&D Spend  Administration  Marketing Spend  Profit
21        8.0            15.0             30.0    11.0
37        4.0             5.0             20.0     9.0
2        15.0            10.0             41.0    19.0
14       12.0            16.0             26.0    13.0
44        2.0            15.0              3.0     7.0

In [218]:
df.iloc[:,0:-1]
df

    R&D Spend  Administration  Marketing Spend  Profit
21        8.0            15.0             30.0    11.0
37        4.0             5.0             20.0     9.0
2        15.0            10.0             41.0    19.0
14       12.0            16.0             26.0    13.0
44        2.0            15.0              3.0     7.0

In [219]:
df.iloc[1,0] = np.NaN
df.iloc[3,1] = np.NaN
df.iloc[-1,-1] = np.NaN

In [220]:
df.head()

    R&D Spend  Administration  Marketing Spend  Profit
21        8.0            15.0             30.0    11.0
37        NaN             5.0             20.0     9.0
2        15.0            10.0             41.0    19.0
14       12.0             NaN             26.0    13.0
44        2.0            15.0              3.0     NaN

In [221]:
# step 1- Imputer all missing value with mean of respective col

df0 = pd.DataFrame()

df0['R&D Spend'] = df['R&D Spend'].fillna(df['R&D Spend'].mean())
df0['Administration'] = df['Administration'].fillna(df['Administration'].mean())
df0['Marketing Spend'] = df['Marketing Spend'].fillna(df['Marketing Spend'].mean())

In [222]:
# 0th Itearation

df0

    R&D Spend  Administration  Marketing Spend
21       8.00           15.00             30.0
37       9.25            5.00             20.0
2       15.00           10.00             41.0
14      12.00           11.25             26.0
44       2.00           15.00              3.0

In [223]:
# Remove the col1 imputed value
df1 = df0.copy()

df1.iloc[1,0] = np.NaN

df1

    R&D Spend  Administration  Marketing Spend
21        8.0           15.00             30.0
37        NaN            5.00             20.0
2        15.0           10.00             41.0
14       12.0           11.25             26.0
44        2.0           15.00              3.0

In [224]:
# use first 3 rows to build and use the last for predication

X = df1.iloc[[0,2,3,4],1:3]
X

    Administration  Marketing Spend
21           15.00             30.0
2            10.00             41.0
14           11.25             26.0
44           15.00              3.0

In [225]:
y = df1.iloc[[0,2,3,4],0]
y

21     8.0
2     15.0
14    12.0
44     2.0
Name: R&D Spend, dtype: float64

In [226]:
lr = LinearRegression()
lr.fit(X,y)
value = lr.predict(df1.iloc[1,1:].values.reshape(1,2))
value

c:\Users\abdul\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\base.py:420: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([16.90857414])

In [227]:
df1.iloc[1,0] = value

In [228]:
df1

    R&D Spend  Administration  Marketing Spend
21   8.000000           15.00             30.0
37  16.908574            5.00             20.0
2   15.000000           10.00             41.0
14  12.000000           11.25             26.0
44   2.000000           15.00              3.0

In [229]:
# Remove the col2 imputes value
df1.iloc[3,1] = np.NaN

df1

    R&D Spend  Administration  Marketing Spend
21   8.000000            15.0             30.0
37  16.908574             5.0             20.0
2   15.000000            10.0             41.0
14  12.000000             NaN             26.0
44   2.000000            15.0              3.0

In [230]:
# Use last 3 rows to build a model and use the first for predication
X = df1.iloc[[0,1,2,4],[0,2]]
X

    R&D Spend  Marketing Spend
21   8.000000             30.0
37  16.908574             20.0
2   15.000000             41.0
44   2.000000              3.0

In [231]:
y = df1.iloc[[0,1,2,4],1]
y

21    15.0
37     5.0
2     10.0
44    15.0
Name: Administration, dtype: float64

In [232]:
lr = LinearRegression()
lr.fit(X,y)
value = lr.predict(df1.iloc[3,[0,2]].values.reshape(1,2))

c:\Users\abdul\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\base.py:420: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

In [233]:
df1.iloc[3,1] = value

In [234]:
df1

    R&D Spend  Administration  Marketing Spend
21   8.000000       15.000000             30.0
37  16.908574        5.000000             20.0
2   15.000000       10.000000             41.0
14  12.000000       10.332766             26.0
44   2.000000       15.000000              3.0

In [235]:
# Remove the col3 imputed value
df1.iloc[4,-1] = np.NaN

df1

    R&D Spend  Administration  Marketing Spend
21   8.000000       15.000000             30.0
37  16.908574        5.000000             20.0
2   15.000000       10.000000             41.0
14  12.000000       10.332766             26.0
44   2.000000       15.000000              NaN

In [236]:
# Use last 3 rows to build a model and use the first for prediction
X = df1.iloc[0:4,0:2]
X

    R&D Spend  Administration
21   8.000000       15.000000
37  16.908574        5.000000
2   15.000000       10.000000
14  12.000000       10.332766

In [237]:
y = df1.iloc[0:4,-1]
y

21    30.0
37    20.0
2     41.0
14    26.0
Name: Marketing Spend, dtype: float64

In [238]:
lr = LinearRegression()
lr.fit(X,y)
value = lr.predict(df1.iloc[4,0:2].values.reshape(1,2))

c:\Users\abdul\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\base.py:420: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

In [239]:
df1.iloc[4,-1] = value

In [240]:
# After 1st Iteration
df1

    R&D Spend  Administration  Marketing Spend
21   8.000000       15.000000        30.000000
37  16.908574        5.000000        20.000000
2   15.000000       10.000000        41.000000
14  12.000000       10.332766        26.000000
44   2.000000       15.000000        -5.636947

In [241]:
# Subtract 0th iteration from 1st iteration

df1 - df0

    R&D Spend  Administration  Marketing Spend
21   0.000000        0.000000         0.000000
37   7.658574        0.000000         0.000000
2    0.000000        0.000000         0.000000
14   0.000000       -0.917234         0.000000
44   0.000000        0.000000        -8.636947

In [242]:
df2 = df1.copy()

df2.iloc[1,0] = np.NaN

df2

    R&D Spend  Administration  Marketing Spend
21        8.0       15.000000        30.000000
37        NaN        5.000000        20.000000
2        15.0       10.000000        41.000000
14       12.0       10.332766        26.000000
44        2.0       15.000000        -5.636947

In [243]:
X = df2.iloc[[0,2,3,4],1:3]
y = df2.iloc[[0,2,3,4],0]

lr = LinearRegression()
lr.fit(X,y)
value= lr.predict(df2.iloc[1,1:].values.reshape(1,2))

c:\Users\abdul\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\base.py:420: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

In [244]:
df2.iloc[1,0] = value

In [245]:
df2.iloc[3,1] = np.NaN
X = df2.iloc[[0,1,2,4],[0,2]]
y = df2.iloc[[0,1,2,4],1]

lr = LinearRegression()
lr.fit(X,y)
lr.predict(df2.iloc[3,[0,2]].values.reshape(1,2))

c:\Users\abdul\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\base.py:420: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([10.41028106])

In [246]:
df2.iloc[3,1] = 11.58

In [247]:
df2.iloc[4,-1] = np.NaN

X = df2.iloc[0:4,0:2]
y = df2.iloc[0:4,-1]

lr = LinearRegression()
lr.fit(X,y)
value = lr.predict(df2.iloc[4,0:2].values.reshape(1,2))

c:\Users\abdul\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\base.py:420: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

In [248]:
df2.iloc[4,-1] = value

In [249]:
df2

    R&D Spend  Administration  Marketing Spend
21   8.000000           15.00        30.000000
37  16.436287            5.00        20.000000
2   15.000000           10.00        41.000000
14  12.000000           11.58        26.000000
44   2.000000           15.00        -5.714299

In [250]:
df2 - df1

    R&D Spend  Administration  Marketing Spend
21   0.000000        0.000000         0.000000
37  -0.472287        0.000000         0.000000
2    0.000000        0.000000         0.000000
14   0.000000        1.247234         0.000000
44   0.000000        0.000000        -0.077353

In [251]:
df3 = df2.copy()

df3.iloc[1,0] = np.NaN

df3

    R&D Spend  Administration  Marketing Spend
21        8.0           15.00        30.000000
37        NaN            5.00        20.000000
2        15.0           10.00        41.000000
14       12.0           11.58        26.000000
44        2.0           15.00        -5.714299

In [252]:
X = df3.iloc[[0,2,3,4],1:3]
y = df3.iloc[[0,2,3,4],0]

lr = LinearRegression()
lr.fit(X,y)
value = lr.predict(df3.iloc[1,1:].values.reshape(1,2))

c:\Users\abdul\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\base.py:420: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

In [253]:
df3.iloc[1,0] = value

In [254]:
df3.iloc[3,1] = np.NaN
X = df3.iloc[[0,1,2,4],[0,2]]
y = df3.iloc[[0,1,2,4],1]

lr = LinearRegression()
lr.fit(X,y)
value = lr.predict(df3.iloc[3,[0,2]].values.reshape(1,2))

c:\Users\abdul\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\base.py:420: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

In [255]:
df3.iloc[3,1] = value

In [256]:
df3.iloc[4,-1] = np.NAN

X = df3.iloc[0:4,0:2]
y = df3.iloc[0:4,-1]

lr = LinearRegression()
lr.fit(X,y)
value = lr.predict(df3.iloc[4,0:2].values.reshape(1,2))

c:\Users\abdul\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\base.py:420: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

In [257]:
df.head()

    R&D Spend  Administration  Marketing Spend  Profit
21        8.0            15.0             30.0    11.0
37        NaN             5.0             20.0     9.0
2        15.0            10.0             41.0    19.0
14       12.0             NaN             26.0    13.0
44        2.0            15.0              3.0     NaN

In [258]:
X

    R&D Spend  Administration
21   8.000000       15.000000
37  17.843416        5.000000
2   15.000000       10.000000
14  12.000000       10.773072

In [259]:
df3.head(5)

    R&D Spend  Administration  Marketing Spend
21   8.000000       15.000000             30.0
37  17.843416        5.000000             20.0
2   15.000000       10.000000             41.0
14  12.000000       10.773072             26.0
44   2.000000       15.000000              NaN

In [260]:
df3.iloc[4,-1] = value

In [261]:
df2.iloc[3,1] = 11.2

In [262]:
df3

    R&D Spend  Administration  Marketing Spend
21   8.000000       15.000000        30.000000
37  17.843416        5.000000        20.000000
2   15.000000       10.000000        41.000000
14  12.000000       10.773072        26.000000
44   2.000000       15.000000       -13.997909

In [263]:
df3 - df2

    R&D Spend  Administration  Marketing Spend
21    0.00000        0.000000         0.000000
37    1.40713        0.000000         0.000000
2     0.00000        0.000000         0.000000
14    0.00000       -0.426928         0.000000
44    0.00000        0.000000        -8.283609

### Get now

In [264]:
df0

    R&D Spend  Administration  Marketing Spend
21       8.00           15.00             30.0
37       9.25            5.00             20.0
2       15.00           10.00             41.0
14      12.00           11.25             26.0
44       2.00           15.00              3.0

In [265]:
df0.iloc[1,0] = np.nan
df0.iloc[3,1] = np.nan
df0.iloc[4,2] = np.nan

In [266]:
df0

    R&D Spend  Administration  Marketing Spend
21        8.0            15.0             30.0
37        NaN             5.0             20.0
2        15.0            10.0             41.0
14       12.0             NaN             26.0
44        2.0            15.0              NaN

In [268]:
d = pd.DataFrame()

d['R&D Spend'] = df['R&D Spend'].fillna(df['R&D Spend'].mean())
d['Administration'] = df['Administration'].fillna(df['Administration'].mean())
d['Marketing Spend'] = df['Marketing Spend'].fillna(df['Marketing Spend'].mean())

# d.loc['R&D Spend'] = df['R&D Spend'].fillna(df['R&D Spend'].mean())
# d.loc['Administration'] = df['Administration'].fillna(df['Administration'].mean())
# d.loc['Marketing Spend'] = df['Marketing Spend'].fillna(df['Marketing Spend'].mean())

In [269]:
d.head()

    R&D Spend  Administration  Marketing Spend
21       8.00           15.00             30.0
37       9.25            5.00             20.0
2       15.00           10.00             41.0
14      12.00           11.25             26.0
44       2.00           15.00              3.0